app/controllers/songs_controller.rb

  def upload
    CSV.foreach(params[:songs].path, headers: true) do |song|
      Song.create(title: song[0], artist_name: song[1])
---
INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "ARTIST CLEAN"], ["created_at", "2018-12-05 00:35:40.592809"], ["updated_at", "2018-12-05 00:35:40.592809"]]
INSERT INTO "songs" ("title", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Song Clean"], ["artist_id", 7], ["created_at", "2018-12-05 00:35:40.597585"], ["updated_at", "2018-12-05 00:35:40.597585"]]